{"status":"success","language":"en","categories_filter":null,"search_term":"iran,israel","domains_filter":"foreignpolicy.com","published_after":"2025-06-18","extract_content":true,"sources":["thenewsapi","guardian","gnews"],"meta":{"thenewsapi":{"found":2,"returned":2,"limit":3,"page":1},"guardian":{"total":86,"pageSize":5,"currentPage":1},"gnews":{"totalArticles":1,"articles":1}},"articles":[{"uuid":"ceebae67-e66e-4a95-95fd-ce4f9668bc8f","title":"What Regime Change Means in Iran","description":"The new Iran that emerges from the current conflict, but don’t expect a democracy.","keywords":"","snippet":"In this transformation, Iran will turn from an ideological actor to an interest-focused authoritarian state. It will be defined not by Islam, but rather by Iran...","url":"https://foreignpolicy.com/2025/06/19/what-regime-change-means-in-iran/","image_url":"https://foreignpolicy.com/wp-content/uploads/2025/06/GettyImages-1544619181.jpg?w=1000","language":"en","published_at":"2025-06-19T05:59:28.000000Z","source":"foreignpolicy.com","categories":["general","politics"],"relevance_score":16.403564,"locale":"us","source_api":"thenewsapi","content":"The new Iran that emerges from the current conflict, but don’t expect a democracy. Israel’s relentless war on Iran is likely to fundamentally reshape the trajectory of the latter’s history. But this is not likely to be a regime change as it’s typically imagined, a swift replacement of the Islamic Republic with a democracy. More plausibly, the war will accelerate a process that was quietly underway long before Israeli jets took off on June 13 to bombard Iran. In this transformation, Iran will turn from an ideological actor to an interest-focused authoritarian state. It will be defined not by Islam, but rather by Iranian civilization. It will stop obsessing about how Islamic its citizens are and instead try to provide them with basic services. It will seek economic development, not ways to export its revolution. It will try to trade with the West, not fight it. It will be led by oligarchs and generals, not clerics and ideologues. In short, it will resemble most of its neighbors in the Arab world. Israel’s relentless war on Iran is likely to fundamentally reshape the trajectory of the latter’s history. But this is not likely to be a regime change as it’s typically imagined, a swift replacement of the Islamic Republic with a democracy. More plausibly, the war will accelerate a process that was quietly underway long before Israeli jets took off on June 13 to bombard Iran. In this transformation, Iran will turn from an ideological actor to an interest-focused authoritarian state. It will be defined not by Islam, but rather by Iranian civilization. It will stop obsessing about how Islamic its citizens are and instead try to provide them with basic services. It will seek economic development, not ways to export its revolution. It will try to trade with the West, not fight it. It will be led by oligarchs and generals, not clerics and ideologues. In short, it will resemble most of its neighbors in the Arab world. Iran has gotten to this point because of the utter failures of the man who has led it since 1989, Supreme Leader Ayatollah Ali Khamenei. A devout revolutionary since his days as a bohemian poet and activist in the 1960s, Khamenei long dreamt of changing the world. Unlike many other veterans of the 1979 revolution, he never moderated or adapted to the times, instead continuing to use an entire country for his hopeless cause. The ongoing conflict with Israel is only the latest stage in the long litany of Khamenei’s failures. His goal has long been to fulfill the double ambitions of his predecessor, Ayatollah Ruhollah Khomeini. In their vision, Iran was to be a puritan Islamic society where men and women happily chose to live a Muslim lifestyle. On the world stage, Iran was to spearhead an uncompromising anti-American and anti-Israeli crusade of resistance, arming its ideological allies everywhere and pursuing self-reliance even to the point of isolation. Both of these dreams have failed manifestly and spectacularly. Iran today is among the least religious societies in the Muslim world. Iranians are among the most avid consumers of global pop culture and have little time for the Islamic sensibilities. Although the compulsory veiling rule is still on the books, the regime has decided not to enforce it as seriously, and millions of women now walk around with bare heads. Tehran does not look like an Islamic model city. On the foreign policy front, Khamenei used to be able to claim a few successes, even if they came at the high cost of international isolation for Iran. Pro-Tehran forces controlled four Arab capitals, and Israel was surrounded by the so-called Axis of Resistance, a network of militias funded, armed, and inspired by Iran. But the combined force of Arab diplomatic initiatives, Israel’s battering of the axis, and the fall of the Assad regime in Syria have destroyed all that the old man had built. The fall of the axis vanquished not just Khamenei’s ideological achievement, but also the Islamic Republic’s defense doctrine against Israel. With it gone, Israel was able to take the war to Iran. Khamenei will be now known as a leader who brought his people economic misery, domestic repression, and a murderous war. The leader’s failure has long been apparent to many in the Iranian economic, military, and political elite. The old man has stuck to power but, at 86, his demise is not far and the battle over his succession is already raging. Among the factions jockeying for power in the post-Khamenei Iran, most are led by pragmatically oriented figures who share none of Khamenei’s revolutionary doctrine. If they have an ideology, it’s a mixture of Iranian nationalism and technocracy. They watch with envy as Iran’s neighbors put old conflicts to bed and seek economic development. These pragmatic elites have been party to Islamic Republic’s fractious internal politics for decades. Their godfather was Akbar Hashemi Rafsanjani, a powerful president in the 1990s, who was gradually sidelined by Khamenei before dying a suspicious death in 2017. Rafsanjani’s main disciple, President Hassan Rouhani, led the diplomatic talks with the Obama administration that resulted in the 2015 nuclear deal, which was intended to lift the sanctions on the Iranian economy and open it up to the West. Rafsanjani and Rouhani were part of the founding generation of the 1979 revolution who had undergone a fundamental shift and concluded that the revolution’s ideals were best pursued by prioritizing good governance and prosperity. Had U.S. President Donald Trump not left that deal in 2018, it could have ended in a historic victory for the pragmatic elites vis-à-vis the Islamist hard-liners. Trump’s scuttling of the deal was a massive blow that weakened them for years. But the hard-liners weren’t able to win the internal battle. Khamenei himself knows that he is alone at the top. In a landmark 2019 speech to mark the 40th anniversary of the revolution, he said that the future Iran must be led by “devout and revolutionary youth,” knowing full well that the established elites did not match the criteria. In recent years, Khamenei’s continued failure has emboldened the pragmatists. It helps that their ideas are more in tune with the Iranian public. Since 1997, any time that Iranians have been given a meaningful choice at the ballot box, they have voted against the hard-liners and for the pragmatists. Last summer, they chose the reformist Masoud Pezeshkian as president and snubbed arch-hard-liner Saeed Jalili. Hard-liners have been marginalized at most levels of power. In addition to Pezeshkian, the heads of two other branches of the government—the parliament and the judiciary—don’t sympathize with the hard-liners, either. The powerful Islamic Revolutionary Guard Corps often have little time for the hard-liners who are seen as bookish, doctrinaire, and dangerous to Iran’s social equilibrium due to their insistence on enforcing social puritanism by the force of arms. Changes in the region have helped put wind in the sails of the pragmatists. They look up to Saudi Arabia and its de facto leader, Crown Prince Mohammed bin Salman, due to the swiftness of social changes that he brought to his country and his impressive leveraging of his relationship with Trump. The Iranian-Saudi reconciliation process started in 2023 and has gathered pace since. In April, a large Saudi military delegation visited Iran. The establishment in Tehran now jealously guards its good ties with Riyadh and has tried to resume diplomatic ties with Saudi allies Egypt and Bahrain. The conflict with Israel will only accelerate a process that was already underway. The Iranian elites are now hard at work defending their country against foreign attacks. But they are likely livid at Khamenei for having brought them to this point by his disastrous lack of strategy and his long-lasting crusade against Israel. Faezeh Hashemi, an outspoken former lawmaker and a daughter of Rafsanjani, spoke for many when she said that, in facing Israeli attacks, Iran was “reaping what it had sown.” When the pragmatists find their composure, they will take the reins and attempt to bring about a truce, including by promising the West and Israel that they’ll give up on permanent hostility toward them. They’ll give the necessary concessions on the nuclear program to preserve their privileges and prevent further destruction of Iran and its infrastructure. This could take a few different forms. Rouhani could make a comeback and be given the informal command of the country. Perhaps he could be declared deputy commander in chief, a title held by Rafsanjani during the 1980-88 war with Iraq, when Rafsanjani effectively ran the war effort because Khomeini was too old and frail. Perhaps a group of military commanders could formally depose Khamenei and take power for themselves. Candidates for military leadership include Mohammad Bagher Ghalibaf, the speaker of parliament, or Ali Shamkhani, a powerful former national security advisor who was almost killed in the Israeli strikes. But whatever form it takes, the contours of this likely scenario are clear: Iran’s 1979 revolution will be finally put to rest. Iran will surrender its long hostility toward the West. Iran’s long history is filled with many a martial hero, but even as it finds itself in one of its worst wars ever, Iranians are looking for a diplomatic hero instead. They are asking if their country could have another Abbas Mirza, the Qajar crown prince of early 1800s. Abbas Mirza was traditionally reviled in Iranian historiography due to the controversial peace treaties that he signed with Russia, giving up Iranian territory in the Caucasus. But he is now praised by many as a man who was able to keep Iran’s sovereignty intact. Yes, Iran lost a lot, but it lived to fight another day. That will be the task of Iranian pragmatists today. Arash Azizi is a visiting fellow at Boston University’s Frederick S. Pardee Center for the Study of the Longer-Range Future. His book What Iranians Want: Women, Life, Freedom was published in January 2024. Join the Conversation Commenting is a benefit of a Foreign Policy subscription. Subscribe\nSubscribe Already a subscriber?\n\t\t\t\t\tLog In. View  Comments Join the Conversation Join the conversation on this and other recent Foreign Policy articles when you subscribe now. Subscribe\nSubscribe Not your account?\n\t\t\t\t\tLog out View  Comments Join the Conversation Please follow our comment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs. View  Comments Change your username: I agree to abide by FP’s comment guidelines. (Required) Confirm your username to get started. The default username below has been generated using the first name and last initial on your FP subscriber account. Usernames may be updated at any time and must not contain inappropriate or offensive language. Username I agree to abide by FP’s comment guidelines. (Required) Read More U.S. Inches Closer to Direct Conflict With Iran Tehran has warned Washington that its participation would likely lead to all-out war. |","summary":"The new Iran that emerges from the current conflict, but don’t expect a democracy.","author":"Alexandra Sharp"},{"uuid":"e3654404-2ba6-4851-81eb-79506d9cdcbc","title":"Sheinbaum Makes Her G-7 Debut","description":"After years of disengagement on the global stage, Mexico’s new president is taking a different tack.","keywords":"","snippet":"The highlights this week: The leaders of Brazil and Mexico attend the G-7 summit , Bolivia celebrates a syncretic religious festival , and Nicaragua remembers i...","url":"https://foreignpolicy.com/2025/06/19/brazil-mexico-g7-summit-canada-lula-sheinbaum-carney/","image_url":"https://foreignpolicy.com/wp-content/uploads/2025/06/Carney-Sheinbaum-G7-Canada-Mexico-GettyImages-2219934050.jpg?w=1000","language":"en","published_at":"2025-06-19T12:00:16.000000Z","source":"foreignpolicy.com","categories":["general","politics"],"relevance_score":8.80159,"locale":"us","source_api":"thenewsapi","content":"By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. ✓ Signed Up After years of disengagement on the global stage, Mexico’s new president is taking a different tack. Welcome back to Foreign Policy’s Latin America Brief. The highlights this week: The leaders of Brazil and Mexico attend the G-7 summit, Bolivia celebrates a syncretic religious festival, and Nicaragua remembers its first female president. Welcome back to Foreign Policy’s Latin America Brief. The highlights this week: The leaders of Brazil and Mexico attend the G-7 summit, Bolivia celebrates a syncretic religious festival, and Nicaragua remembers its first female president. Sign up  to receive Latin America Brief in your inbox every Friday. Sign up to receive Latin America Brief in your inbox every Friday. By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. ✓ Signed Up Lula, Sheinbaum Convene in Canada Two Latin American leaders attended this week’s G-7 summit in Kananaskis, Canada: Brazilian President Luiz Inácio Lula da Silva and Mexican President Claudia Sheinbaum. Lula is a familiar face at the G-7. He was in his first term as president when the grouping of wealthy countries, then-known as the G-8, was beginning to expand its annual dialogues to include guests from developing nations in 2003. At the time, the group was responding to criticism that it had become too exclusive. Lula has generally used his G-7 appearances to call for a greater role for the global south in international politics. At the 2003 summit, he argued for the creation of a fund to fight world hunger. Though the idea did not make it into that year’s official communiqué, a similar proposal became a reality in 2024, when Lula hosted the G-20 summit in Rio de Janeiro. Other ideas that Lula defended at past G-7 summits were endorsed more quickly. He called for rich countries to remove agriculture subsidies that Brazil viewed as unfair competition, an issue that was mentioned in the 2008 summit declaration. And he voiced support for a robust deal to fight the climate crisis well before the Paris Agreement was adopted in 2015. This year, Lula suggested that wealthy countries should increase their climate funding to poorer ones and that all countries should tax their super-rich residents more. In a positive signal for Lula’s agenda, ahead of the G-7 summit, Canadian Prime Minister Mark Carney agreed to attend the United Nations climate conference in Brazil in November. Ukrainian President Volodymyr Zelensky, another G-7 guest, also sought a meeting with Lula, a shift from his past criticism of the Brazilian president’s attempts to mediate an end to Russia’s war in Ukraine. However, the meeting was canceled due to what Brazil attributed to a delay in events. Though Lula has been a regular guest of the G-7, Sheinbaum was attending her first summit. Mexico’s president has been frequently invited to the G-7 since 2003. But Sheinbaum’s predecessor, Andrés Manuel López Obrador, never attended a summit. Sheinbaum took office last October. López Obrador’s absence from the summits was part of his broader reluctance to travel abroad or invest much time in diversifying Mexico’s foreign relations beyond traditional partners, such as the United States and a handful of Latin American countries. Even though Mexico and Canada negotiated a trilateral trade pact with the United States under López Obrador, Mexico-Canada relations became more strained by the end of his term, former Canadian and Mexican diplomats said on a recent webinar hosted by the Canadian Council for the Americas. “At the end of the day, it’s Canada’s relationship with the U.S. and Mexico’s relationship with the U.S., which is always going to take precedence over the trilateralization of the agenda,” former Mexican diplomat Arturo Sarukhan said. Sheinbaum’s trip to Alberta marked a clear break from López Obrador. “In an interdependent world, no country can isolate itself,” she said during a summit session. Sheinbaum held bilateral talks with the leaders of Canada, Germany, India, and the European Union. She was also due to meet with U.S. President Donald Trump before he left the gathering early; the two later spoke by phone. Carney said that it was “immediately clear” based on Sheinbaum’s G-7 participation that Mexico should be “at the center of international cooperation.” Sheinbaum responded by giving the Canadian prime minister a soccer ball decorated with Indigenous Mexican art, in honor of next year’s FIFA World Cup, which will be co-hosted by Canada, Mexico, and the United States. Although Carney did not mention “our third co-host, the other president” by name, he said that they “are totally aligned in our excitement, enthusiasm for the beautiful game.” Upcoming Events Saturday, June 22: São Paulo hosts the world’s biggest LGBTQ+ pride event. Wednesday, June 25, to Friday, June 27: The Organization of American States hosts its annual assembly in Antigua and Barbuda. What We’re Following Local leaders stuck in Israel. The Israel-Iran conflict that escalated last week has highlighted a relatively low-profile Israeli diplomatic strategy toward Latin American countries. Local officials from Brazil, Argentina, Paraguay, Guatemala, and Uruguay were temporarily stuck in Israel amid the fighting, which shut down the country’s main international airport. The Latin American officials had traveled to attend a security expo. The Brazilian officials’ itinerary also included meeting with victims of Hamas’s Oct. 7, 2023, attack and their families, the Intercept Brasil reported. As some Latin American leaders criticize Israel’s war conduct in Gaza, Israel has sought to further public diplomacy at the subnational level. Last year, Israel named Lula persona non grata after he said Israel was committing genocide in Gaza and compared its actions to the Holocaust. Many Brazilian mayors on the latest trip hailed from Brazil’s opposition. Many of the Latin American leaders have since managed to depart via Jordan. Though Brazil’s foreign ministry worked to safely extract the mayors, it also made a point to say they had disobeyed its travel advisory by visiting Israel during a war. Brazil’s critical minerals. China has tightened rare-earth export controls in recent months, underscoring how important it is that countries have diverse suppliers of the critical minerals. Brazil has the world’s second-largest rare earth reserves after China, according to the U.S. Geological Survey, and Lula says the country is working to expand production. But that is up from a very low baseline: In 2024, Brazil was responsible for less than 1 percent of global rare-earth mining production, while China was the source of around 70 percent. Brazil’s national development bank is among the government actors working to ramp up investment in the critical minerals sector. Last week, the bank announced it had selected 56 mineral projects to receive special financing, including 10 involving rare earths; others focus on lithium, graphite, copper, and silicon. Together, the projects represent over $8 billion in investment. Companies involved hail from countries including Australia, Brazil, Canada, and the United States. Dancers of the Diablada fraternity perform during the Jesús del Gran Poder religious festival in La Paz, Bolivia, on June 14.Aizar Raldes/AFP via Getty Images Syncretic religious festival. Last Saturday, Bolivians celebrated the annual festival of Jesus of Great Power, which mixes Catholic and Indigenous Andean traditions with elaborate costume parades and dancing in the streets. Its origins lie in a painting of Jesus displayed in the 1600s at a Catholic chapel in La Paz, which is Bolivia’s capital today. Eventually, La Paz residents began holding ceremonies in honor of the depicted Jesus’s supposed ability to grant miracles. Although tens of thousands of people participate in the event annually, this year’s festivities were more subdued in the wake of deadly political demonstrations in Bolivia. Six people died in clashes between supporters and opponents of former President Evo Morales in recent weeks. Parades during the festival featured a black ribbon of mourning and calls for peace. Question of the Week In addition to rare earths, another mineral important to the energy transition is copper. Chile has Latin America’s largest copper reserves. Which country has the region’s second largest? Mexico Peru Bolivia Brazil Mexico comes in third, according to the U.S. Geological Survey. FP’s Most Read This Week In Focus: A Mother of Modern Nicaragua Nicaraguan President Violeta Chamorro arrives at the National Stadium in San José, Costa Rica, on May 8, 1990. She was there to attend the inauguration ceremony of Costa Rican President-elect Rafael Ángel Calderón Guardia.David Ake/AFP via Getty Images Last week, Nicaragua said it would sever ties with the United Nations refugee agency, months after doing the same with the International Organization for Migration. The moves added to the slow drip of international isolation and political repression that have defined Nicaragua under authoritarian President Daniel Ortega. But the death of former Nicaraguan President Violeta Chamorro last Saturday recalled visions of a different time in the country’s history. Chamorro became politically active in the late 1970s, when she stepped in to run a newspaper that was opposed to Nicaragua’s Somoza dictatorship following the assassination of her husband, who was its editor in chief. The dictatorship ruled from 1936 to 1979, when the leftist Sandinista rebels overthrew Somoza. Chamorro served for a few months as part of the Sandinista provisional government, but she soon departed amid opposition to the Sandinistas’ Marxist direction and concentration of power. During the 1980s, the Sandinistas fought off armed resistance by U.S.-backed rebels in what is known as the Contra War. In 1990, Chamorro ran as a unity opposition candidate against Ortega, who represented the Sandinistas. She won a surprise victory and went on to serve a six-year term, helping move the country past civil war and opening the door to more pluralistic politics. As president, Chamorro oversaw the disarmament of former rebels and established more diverse international relationships, including with the United States. Her administration was followed by two different center-right presidents before Ortega was elected in 2007. He has remained president ever since. When Chamorro’s daughter, Cristiana, tried to run against Ortega in 2021, she and several other opposition candidates were barred; the Ortega administration later stripped Cristiana of her Nicaraguan citizenship. Chamorro and her four children lived outside of Nicaragua in the years before her death; her funeral was held in Costa Rica. Another one of her children, journalist Carlos Chamorro, said at the funeral service that his mother’s life served as an example of “hope.” But in a grave sign for the political climate inside the country, he said, several Nicaraguan priests refrained from mentioning Chamorro’s name during Sunday services because they had been warned by confidantes that they could face consequences for doing so. Catherine Osborn is the writer of Foreign Policy’s weekly Latin America Brief. She is a print and radio journalist based in Rio de Janeiro. X: @cculbertosborn Join the Conversation Commenting is a benefit of a Foreign Policy subscription. Subscribe\nSubscribe Already a subscriber?\n\t\t\t\t\tLog In. View  Comments Join the Conversation Join the conversation on this and other recent Foreign Policy articles when you subscribe now. Subscribe\nSubscribe Not your account?\n\t\t\t\t\tLog out View  Comments Join the Conversation Please follow our comment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs. View  Comments Change your username: I agree to abide by FP’s comment guidelines. (Required) Confirm your username to get started. The default username below has been generated using the first name and last initial on your FP subscriber account. Usernames may be updated at any time and must not contain inappropriate or offensive language. Username I agree to abide by FP’s comment guidelines. (Required)","summary":"After years of disengagement on the global stage, Mexico’s new president is taking a different tack.","author":"John Haltiwanger"},{"uuid":"australia-news/live/2025/jun/20/australia-news-live-israel-defence-foreign-minister-iran-northern-beaches-hospital-nsw-ntwnfb","title":"Australia news live: Penny Wong announces suspension of Tehran embassy and orders officials to leave Iran; Coalition urges PM to visit Nato summit","description":"Follow live","url":"https://www.theguardian.com/australia-news/live/2025/jun/20/australia-news-live-israel-defence-foreign-minister-iran-northern-beaches-hospital-nsw-ntwnfb","image_url":"https://media.guim.co.uk/fed24f9c2888177700b385cf353d84b866d09667/545_0_5453_4362/500.jpg","language":"en","published_at":"2025-06-19T23:32:40Z","source":"theguardian.com","categories":["Australia news"],"source_api":"guardian","content":"Penny Wong announces suspension of Tehran embassy Australia’s embassy in Tehran has suspended operations and the government is ordering officials to leave Iran, the foreign affairs minister, Penny Wong, has said, over concerns about “the deteriorating security environment”. As alarm grows about the conflict between Iran and Israel, Wong said the Australian ambassador to Iran would “remain in the region to support the Australian government’s response to this crisis”, while consular staff are being deployed to neighbouring Azerbaijan, “including its border crossings, to support Australians departing Iran”. The government is trying to assist Australians to leave Iran but Wong said options were limited. “The Australian government has directed the departure of all Australian officials and dependents and suspended operations at our embassy in Tehran, based on advice about the deteriorating security environment in Iran,” Wong said this morning. We urge Australians who are able to leave Iran to do so now, if it is safe. Those who are unable to, or do not wish to leave, are advised to shelter in place. Wong said the government was “continuing planning to support Australians seeking to depart Iran” – but at this stage “our ability to provide consular services is extremely limited due to the situation on the ground. The airspace remains closed.” “Dfat will also continue to provide support through the 24-hour consular emergency centre, direct contact with Australian citizens who have registered on our crisis portal and updates to travel advice,” she said. The suspension of embassy operations is consistent with steps taken by other countries, including New Zealand and Switzerland. Australians in Iran seeking consular assistance should call the Australian government’s 24-hour consular emergency centre on +61 2 6261 3305 outside Australia and 1300 555 135 in Australia, Wong said.","summary":"Follow live","author":"Nick Visser"},{"uuid":"world/live/2025/jun/19/israel-iran-conflict-live-hospital-in-southern-israel-hit-in-iran-missile-strike-say-israeli-officials","title":"Israel-Iran conflict live: Israeli military issues evacuation warning to residents in Iranian industrial area","description":"Trump to make decision on whether to attack Iran ‘within two weeks’, says White House","url":"https://www.theguardian.com/world/live/2025/jun/19/israel-iran-conflict-live-hospital-in-southern-israel-hit-in-iran-missile-strike-say-israeli-officials","image_url":"https://media.guim.co.uk/2fb597defb11fac933d099c454680b6a5f143452/462_0_4585_3668/500.jpg","language":"en","published_at":"2025-06-19T23:32:17Z","source":"theguardian.com","categories":["World news"],"source_api":"guardian","content":"White House: Trump to make a decision on whether to attack Iran 'within two weeks' The White House said that Donald Trump will “make a decision on whether to attack Iran within two weeks”. Speaking to reporters on Thursday, White House press secretary Karoline Leavitt cited a message from Trump in which he said: “Based on the fact that there’s a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks.” Leavitt added that “correspondence has continued with Iran”.","summary":"Trump to make decision on whether to attack Iran ‘within two weeks’, says White House","author":"Helen Livingstone"},{"uuid":"business/2025/jun/20/uk-consumer-confidence-figures-analysis","title":"UK consumer confidence up but fragile amid tariff and Middle East concerns","description":"Analysts say households are remaining cautious under ‘dark shadow of inflation’","url":"https://www.theguardian.com/business/2025/jun/20/uk-consumer-confidence-figures-analysis","image_url":"https://media.guim.co.uk/a1526856fd972e8b7518bb49843aa303071cef59/500_0_5000_4000/500.jpg","language":"en","published_at":"2025-06-19T23:01:18Z","source":"theguardian.com","categories":["Business"],"source_api":"guardian","content":"Analysts say households are remaining cautious under ‘dark shadow of inflation’ Confidence among UK consumers has improved but remains fragile in the face of expected petrol price rises amid escalating conflict in the Middle East, according to a leading index. The latest snapshot from the data company GfK says sentiment improved by two points in June but remained in negative territory at -18, well below the -12 of a year ago. A reading above zero indicates optimism; below indicates pessimism. The last time the headline index, which is closely watched by the government and the Bank of England, was positive was in January 2016, when it was at 4. It has had double-digit negative readings since September 2021 when Britain was in the grip of Covid-19. Last month, sentiment hit its lowest level since November 2023 as a combination of domestic tax increases, rising bills and worries over Donald Trump’s trade wars weighed on minds. Consumers became more optimistic about the overall economy this month, with scores up three points when judging how the past year went, and up by five points when looking at the next 12 months. However, both measures were firmly stuck in negative territory, at -43 and -28 respectively. Assessments of personal financial situations were unchanged, with the score for the past 12 months at -7 and the measure looking ahead was in positive territory, at 2. Neil Bellamy, consumer insights director at GfK, said: “Consumers have been resolute in their views on their wallets, with June’s personal financial situation scores (past and future) unchanged from May. Yet confidence is still fragile because the dark shadow of inflation is a day-to-day challenge for so many of us.” The cost of filling up a car started creeping up this week when crude oil prices rose sharply after Israel’s attack on Iran. A litre of petrol now costs 132.8p while diesel is at 138.9p, according to the AA motoring group. Rob Wood, chief UK economist at Pantheon Macroeconomics, said: “Looking ahead, consumer confidence will likely be squeezed by gradually easing wage growth while inflation remains at about 3.5% for the rest of the year, and unemployment will likely creep up. “The prospect of tax increases in the October budget could also weigh on households. But real income should continue eking out gains given that average earnings rose 5.5% year-over-year in March. We also expect unemployment to rise only modestly to a peak of 4.9%.” Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion Gen Z is driving improvements in confidence, with younger generations the most optimistic about the future, a separate survey from the British Retail Consortium showed on Thursday. Consumer sentiment improved for the second month in a row to the highest level since Christmas but remained in negative territory. “This rising optimism may also reflect the increase in minimum wage from April, with many younger people expected to have seen a significant uplift in their pay packet,” said Helen Dickinson, the BRC’s chief executive. “Expectations of future spending – both in retail and more generally – rose slightly, with more spending on groceries planned over the coming months.”","summary":"Analysts say households are remaining cautious under ‘dark shadow of inflation’","author":"Julia Kollewe"},{"uuid":"world/2025/jun/19/israel-attacks-irans-arak-heavy-water-reactor-as-iran-hits-israeli-hospital","title":"Trump sets deadline of two weeks to decide if US will join Israel’s war on Iran","description":"US president leaves window for negotiation after Israeli defence minister openly embraces regime change","url":"https://www.theguardian.com/world/2025/jun/19/israel-attacks-irans-arak-heavy-water-reactor-as-iran-hits-israeli-hospital","image_url":"https://media.guim.co.uk/80b723de0cf267ac9ebeb43ea6ef84a551196e23/917_0_4583_3668/500.jpg","language":"en","published_at":"2025-06-19T22:41:22Z","source":"theguardian.com","categories":["World news"],"source_api":"guardian","content":"US president leaves window for negotiation after Israeli defence minister openly embraces regime change Middle East crisis – live updates Donald Trump has set a two-week deadline to decide whether the US will join Israel’s war with Iran, allowing time to seek a negotiated end to the conflict, the White House has said. The decision to leave a window for diplomacy came after Israel’s defence minister openly embraced regime change in Tehran as a war aim. On a visit to a hospital hit by an Iranian missile, Israel Katz said Iran’s supreme leader, Ayatollah Ali Khamenei, “cannot be allowed to exist” and that he had ordered a surge in attacks to “undermine” the Iranian government. The Israeli prime minister, Benjamin Netanyahu, later insisted that toppling Iran’s leaders was “not a stated or formal goal”, as as the conflict entered its seventh day. The White House said on Thursday that the US president would “make a decision on whether to attack Iran within two weeks”. It added that correspondence with Tehran had continued and there was still hope of negotiations. Trump’s decision on whether to join the assault against Iran hinged in part on whether America’s most powerful conventional “bunker buster” bombs would be able to take out Iran’s most heavily protected nuclear facility, sources familiar with the deliberations said. Israel does not have weapons capable of destroying the Fordow complex, which is buried up to 100 metres below a mountain near the holy city of Qom. Netanyahu and his allies have been encouraging the US to shift from backing Israel’s defence to joining the attack, telling Trump that he alone can “finish off” Iran’s nuclear project. Strike plans have been drawn up, but Trump is waiting to see if Tehran will make a last-minute deal to abandon its nuclear programme, sources said. Amid global warnings against further escalation, Europe is pushing for a diplomatic solution to the war. Iran’s foreign minister is travelling to Geneva to meet his British, French and German counterparts on Friday. There have also been offers of mediation from the Russian president, Vladimir Putin, and regional powers including Oman. On Thursday the UK foreign secretary, David Lammy, met his US counterpart, Marco Rubio, at the White House, with the focus on the Middle East. They were joined by the British ambassador, Lord Mandelson, and Trump’s special envoy to the Middle East, Steve Witkoff, for the meeting. Lammy said later: “The situation in the Middle East remains perilous. We are determined that Iran must never have a nuclear weapon … we discussed how a deal could avoid a deepening conflict. A window now exists within the next two weeks to achieve a diplomatic solution.” He added: “Now is the time to put a stop to the grave scenes in the Middle East and prevent a regional escalation that would benefit no one.” When Israel launched the conflict a week ago, Netanyahu described it as a focused operation to halt Iran’s progress towards making a nuclear bomb, but he has been increasingly vocal about his desire for the government in Tehran to fall. On a visit to the Soroka hospital in Beersheba on Thursday, after it was hit by an Iranian missile overnight, Netanyahu said Israel was creating conditions for regime change but that Iranians needed to rise up. Referencing a story from the Bible about the Persian emperor Cyrus the Great liberating Jewish people enslaved in Babylon, Netanyahu told journalists: “Today, a Jewish state is creating the means to liberate the Persian people.” Netanyahu later said the fall of the Iranian regime was for the country’s people to decide. “It could be a result, but it’s not a stated or formal goal that we have,” he told Israeli public broadcaster Kan. Iranians have repeatedly attempted to topple or reform their government over decades, and thousands have paid with their lives or freedom. Many opposition figures, including political prisoners, have rejected the idea that an Israeli war which has already killed hundreds of civilians represents a path to liberation for their country. They have a grim warning in the fate of neighbouring Iraq after US forces toppled Saddam Hussein. His downfall was celebrated by many Iraqis, but was followed by decades of extreme and often sectarian violence which paved the way for the rise of Islamic State. Katz visited Soroka hospital before Netanyahu and effectively called for Khamenei’s assassination. He had earlier said he ordered increased attacks on government targets to undermine the regime. “Khamenei openly declares that he wants Israel destroyed, he personally gives the order to fire on hospitals. He considers the destruction of the state of Israel to be a goal,” Katz told journalists. “Such a man can no longer be allowed to exist.” After its initial focus on military and nuclear sites, Israel recently attacked targets, including the state broadcaster, with no links to the nuclear project, but which Katz described as “symbols of the regime”. Iran’s early morning hit on Soroka hospital in Beersheba did not cause any serious injuries because all staff and patients were in protected areas, the director, Shlomi Kodesh, said. But images of shattered wards and stunned medics examining the damage caused outrage in Israel. Other missiles landed around Tel Aviv, injuring more than 200 people across the country as a whole, four of them seriously. One hit the base of a skyscraper in Ramat Gan, close to central Tel Aviv and about 200 metres from the city’s diamond exchange. “It was like an atom bomb. An earthquake,” said Asher Adiv, 69, who lives in a nearby block of flats. His mother was an Iranian Jew from Isfahan and Asher grew up speaking Farsi. “The Iranian people should make a revolution, and kick out the ayatollahs,” he said. “We are not just fighting for Israel. We are fighting for the whole world. We ask Trump to go inside and finish the problem.” Trump, who initially distanced himself from the conflict, has increased the US military presence in the region as he weighs up ordering US forces to join attacks on Iran. The US president was the first subject most Tel Aviv residents wanted to discuss, as they gathered at the police cordon to watch first responders work among the rubble and shattered glass. Adiv’s wife, Anny, who immigrated from Morocco in 1969, said: “Tell Donald Trump to be beside us. He has to bomb them to finish the nuclear sites.” Khamenei warned on Wednesday that the US would face “irreparable damage” if it shifted from supporting Israel’s defence to an active role in assaults on its territory. Iran’s military has moved missiles to prepare for attacks on US assets if it joins the war, and officials are considering other options to respond to one of the most serious threats since the 1979 revolution that brought the country under the control of clerics. A member of the national security committee in Iran’s parliament, Behnam Saeedi, said Iran could attempt to close the Strait of Hormuz, Reuters reported. The narrow passage is used by vessels carrying a fifth of the world’s daily oil needs. Israeli planes bombed a partly built heavy-water reactor near Arak on Thursday and returned to strike the Natanz nuclear complex. There was no radiation risk from the strike on the reactor, state TV said. Israeli warnings meant the area had been evacuated. Heavy-water reactors are considered a proliferation risk because they can produce plutonium, an alternative to enriched uranium for the core of a nuclear weapon. Israel also targeted the Natanz site, which has been hit several times. Iran says its nuclear programme is for peaceful purposes. It was censured by the International Atomic Energy Agency just before the war began and is the only state without nuclear weapons that enriches uranium to 60%, one technical step away from weapons-grade levels. Israel, which has not signed the nuclear non-proliferation treaty, is the only nuclear-armed power in the region. It has never officially confirmed or denied having nuclear weapons but its status has been an open secret for years. Several countries are preparing to evacuate their citizens from Iran and Israel, while flights to bring back tens of thousands of Israelis stranded outside the country get under way. Israel’s main airport has been closed since the first attacks on Iran. Quique Kierszenbaum contributed to the reporting","summary":"US president leaves window for negotiation after Israeli defence minister openly embraces regime change","author":"Emma Graham-Harrison"},{"uuid":"world/2025/jun/19/thawing-of-relations-between-pakistan-and-us-raises-eyebrows-in-india","title":"Thawing of relations between Pakistan and US raises eyebrows in India","description":"Army chief’s effusive welcome in Washington hints at strategic recalibration amid Middle East turmoil","url":"https://www.theguardian.com/world/2025/jun/19/thawing-of-relations-between-pakistan-and-us-raises-eyebrows-in-india","image_url":"https://media.guim.co.uk/1400f668348e3433392bf3dd01b6f5bb234ef99e/228_0_3929_3144/500.jpg","language":"en","published_at":"2025-06-19T22:24:07Z","source":"theguardian.com","categories":["World news"],"source_api":"guardian","content":"Army chief’s effusive welcome in Washington hints at strategic recalibration amid Middle East turmoil After years in the diplomatic deep freeze, US-Pakistan ties appear to be quickly thawing, with Donald Trump’s effusive welcome for Pakistan’s army chief, Field Marshal Asim Munir, signalling a possible major reset. Once snubbed so badly that former prime minister Imran Khan had to board an ordinary airport shuttle after arriving in the US rather than being whisked off in a limousine, Pakistan is now enjoying top-level access in Washington, including a White House lunch for Munir on Wednesday and meetings with top national security officials. Trump’s perceived friendliness with Munir, coupled with what India considers to be a glossing over of Pakistan’s record on terrorism, has raised Indian eyebrows, especially amid sensitive trade negotiations with the US. In a phone call with Trump on Tuesday, the Indian prime minister, Narendra Modi, strongly rejected the US president’s repeated claims that he had personally brokered peace in the four-day conflict between India and Pakistan in May. The next day, while calling Modi a “fantastic man”, Trump described Munir as “extremely influential” in halting the brief but intense war. “I love Pakistan,” Trump said, before repeating: “I stopped the war between Pakistan and India.” In the phone call, Modi made it “absolutely clear”, said India’s foreign secretary, Vikram Misri, that hostilities ceased only after Pakistan requested a ceasefire, and that no third-party mediation took place. “India has not accepted mediation in the past and never will,” Misri said. Adding to the confusion, a White House press officer said Munir had been invited after suggesting Trump be nominated for the Nobel peace prize for ending the conflict, which followed a terror attack that killed 26 mainly Hindu holidaymakers in Indian-administered Kashmir. Munir’s red-carpet treatment in Washington and high praise from US Central Command hint at a strategic recalibration. Gen Michael E Kurilla, the head of Central Command, recently called Pakistan a “phenomenal” counter-terrorism partner, citing Islamabad’s role in helping to capture the alleged Islamic State Khorasan Province planner behind the 2021 Abbey Gate bombing at Kabul airport, an attack that killed 13 US troops and more than 170 Afghan civilians. Munir’s five-day US tour includes meetings at the Pentagon, the state department, and Central Command headquarters in Florida. Such access is extraordinary for a Pakistani general. “Senior US officials often meet with Pakistani generals. But they don’t get entertained at the White House,” noted Michael Kugelman, a Washington-based south Asia analyst. “Ayub Khan and Zia ul-Haq were exceptions but they came as heads of state.” The shift in tone is stark. India has long positioned itself as the more reliable partner for the US as the world’s largest democracy, a bulwark against China, and a hub for expanding trade and intelligence-sharing. Pakistan, by contrast, has been dogged by accusations of sheltering terrorists and undermining civilian rule. Just a few years ago, Trump himself accused Pakistan of offering “nothing but lies and deceit”. Joe Biden later called it “one of the most dangerous nations in the world”. Indian officials continue to point to Pakistan’s links to major terror attacks, including on its parliament in 2001 and in Mumbai in 2008. Against that backdrop, Washington’s embrace of Munir strikes a jarring note in Delhi, where critics say the US is engaging with the same military establishment long accused of enabling cross-border militancy. Analysts say the pivot may be driven by more than just strategic cooperation. For Trump, it could be personal. “He has a thing for strongmen,” said one US analyst. “He sees something in Munir – the mystique, the military credentials, the aura of control. Trump responds to dominance, and Munir projects it.” That may help to explain why Munir was granted access usually reserved for heads of state. “He probably relished the opportunity to size Munir up,” Kugelman said. “Trump knows that in Pakistan it’s the army chief who really runs the show.” But Munir’s visit is taking place as the Middle East is in turmoil, with Israel striking Iranian targets and Iran firing missiles in retaliation. The US may be hoping that Pakistan, one of the few countries with diplomatic ties to Tehran, could play a role in de-escalation. There’s also a more delicate calculation, with Israel pushing the US to join its military campaign against Iran, which shares a 900km border with Pakistan. That geography puts Islamabad in a pivotal position. Some analysts believe the US may be probing whether Munir would allow surveillance flights or logistical cooperation. But Pakistan’s room for manoeuvre is limited, with public opinion strongly pro-Iran. “Even privately, Pakistan’s military would likely balk at the risks,” Kugelman said. “They can’t afford to be dragged into this. The backlash would be enormous.” For Indian officials, Munir’s reception has revived old memories of the US tendency to tilt towards Pakistan at critical junctures, such as in the cold war moments or post-9/11. But this time, analysts say, the reset may also involve commercial opportunity. Pakistan is actively courting US investment in two of the most volatile and potentially lucrative global commerce sectors: cryptocurrency and critical minerals. “The Trump-Munir meeting shouldn’t be seen only through the lens of the Israel-Iran war,” Kugelman said. “There’s been US-Pakistan engagement on crypto, minerals and counter-terrorism, and Trump takes a deep personal interest in all of these.” He added: “This is classic Trump: ‘What can you do for me? What can I get out of this?’”","summary":"Army chief’s effusive welcome in Washington hints at strategic recalibration amid Middle East turmoil","author":"Penelope MacRae in Delhi"},{"uuid":"https://www.newsweek.com/iran-calls-un-halt-israels-attacks-stop-trump-joining-war-2087523","title":"Iran Calls on UN To Halt Israel's Attacks and Stop Trump From Joining War","description":"Iran's envoy wanted of \"irreversible consequences\" if the U.N. fails to end the war in a letter obtained by Newsweek.","url":"https://www.newsweek.com/iran-calls-un-halt-israels-attacks-stop-trump-joining-war-2087523","image_url":"https://d.newsweek.com/en/full/2666221/iran-un-ambassador-speaks.jpg","language":"en","published_at":"2025-06-18T17:52:04Z","source":"Newsweek","categories":["general"],"source_api":"gnews","content":"Based in his hometown of Staten Island, New York City, Tom O'Connor is an award-winning Senior Writer of Foreign Policy and Deputy Editor of National Security and Foreign Policy at Newsweek, where he specializes in covering the Middle East, North Korea, China, Russia and other areas of international affairs, relations and conflict. He has previously written for International Business Times, the New York Post, the Daily Star (Lebanon) and Staten Island Advance. His works have been cited in more than 1,800 academic papers, government reports, books, news articles and other forms of research and media from across the globe. He has contributed analysis to a number of international outlets and has participated in Track II diplomacy related to the Middle East as well as in fellowships at The Korea Society and Foreign Press Center Japan. Follow @ShaolinTom for daily news on X and his official Facebook page. Email t.oconnor@newsweek.com with tips or for media commentary and appearances. Languages: English and Arabic Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. Newsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content. 🎙️ Voice is AI-generated. Inconsistencies may occur. Iran's ambassador to the United Nations has issued an urgent request to the Security Council calling on the international community, including top powers, to put an end to Israel's ongoing strikes against the Islamic Republic and prevent the United States from joining the conflict. In the letter, shared with Newsweek, Iranian Permanent Representative to the U.N. Amir Saeid Iravani argued Wednesday that \"the Israeli regime, in full coordination with the United States, launched a deliberate, premeditated, and large-scale act of aggression, effectively waging war against the sovereignty and territorial integrity of the Islamic Republic of Iran.\" He said that \"the situation has dangerously escalated due to mounting and undeniable evidence of direct United States involvement in this unlawful campaign of aggressive war against Iran,\" citing \"explicit statements and provocative actions by senior U.S. officials,\" including U.S. President Donald Trump's talk of a potential assassination of Iranian Supreme Leader Ayatollah Ali Khamenei and threats to conduct strikes against Iranian nuclear facilities. Calling for an immediate emergency session of the Security Council, whose permanent, veto-wielding members include China, France, Russia, the United Kingdom and the U.S., he asked member states to condemn \"unlawful use of force\" against Iran, recognize Israel's operation \"as aggression\" and prevent \"further aggression, including any involvement by external powers.\" He also requested the Security Council take \"binding enforcement measures to compel the aggressor to halt its violations.\" Should the Security Council fail to meet the historic \"test,\" he warned of \"far-reaching and irreversible consequences for international peace and security,\" as well as Iran's commitment to exercise its \"inherent right\" to \"self-defense.\" Trump Teases Intervention Israel launched a massive campaign of strikes against Iran late Thursday, early Friday local time, targeting sites and personnel tied to nation's armed forces and nuclear program. The campaign, which came just days before Washington and Tehran were set to hold a sixth round of nuclear talks, has been backed by Trump. The U.S. leader has since increasingly warned of he may intervene directly in support of Israel and called Tuesday for the Islamic Republic's \"unconditional surrender.\" He also issued an ominous threat to Khamenei's life. \"We know exactly where the so-called 'Supreme Leader' is hiding,\" Trump wrote on his Truth Social platform. \"He is an easy target, but is safe there - We are not going to take him out (kill!), at least not for now. But we don't want missiles shot at civilians, or American soldiers. Our patience is wearing thin.\" An Israeli official declined Newsweek's request for comment that same day as to whether Khamenei was considered a viable target. The Israeli campaign has already claimed the lives of at least 585 people, according to the Human Rights Activists monitor, including at least dozens of senior Iranian military commanders and nuclear scientists. Iran has launched hundreds of missiles and drones against Israel in response to the ongoing strikes, killing 24 people, according to Israeli officials. The U.S. has assisted Israel in intercepting the incoming salvos. As to whether Trump would join the conflict offensively, he told reporters outside the White House on Wednesday: \"I may do it, I may not do it. I mean, nobody knows what I'm going to do.\" Trump also alleged Wednesday that Iranian officials had proposed sending a delegation for talks at the White House while arguing it would be \"very late\" for talks. The claim was denied by the Iranian Mission to the U.N. in a statement shared with Newsweek and published to X, formerly Twitter. \"No Iranian official has ever asked to grovel at the gates of the White House,\" the Iranian Mission said. \"The only thing more despicable than his lies is his cowardly threat to 'take out' Iran's Supreme Leader. \"Iran does NOT negotiate under duress, shall NOT accept peace under duress, and certainly NOT with a has-been warmonger clinging to relevance. Iran shall respond to any threat with a counter-threat, and to any action with reciprocal measures.\" US Mobilizes for Conflict Since the October 7, 2023, attack by the Palestinian Hamas movement against Israel that sparked a regional conflict, the U.S. role has been largely limited to conducting strikes against Iran's Axis of Resistance allies, such as Yemen's Ansar Allah, also known as the Houthi movement, and the Islamic Resistance in Iraq, both of which launched attacks against Israel from afar. The U.S. also supported Israeli interceptions of Iranian missiles and drones during two prior exchanges of fire between the archfoes last year. But growing signs that the Trump administration is gearing up to enter the conflict include recent movements of U.S. military aircraft and warships, the evacuation of nonessential personnel from the region and a new task force established by the State Department to help U.S. citizens leave the Middle East. Iran has always denied seeking a nuclear weapon but has significantly ramped up levels of uranium enrichment since Trump abandoned a previous multilateral nuclear agreement during his first administration in 2018. Officials from Israel, which is widely believed to possess its own nuclear arsenal, have alleged that Iran has accumulated enough material to produce up to 15 nuclear bombs. Among Iran's key nuclear sites that have been struck thus far include the Natanz enrichment plant and Isfahan Nuclear Technology Center. One site that has yet to be targeted, however, is the heavily fortified Fordow Fuel Enrichment Plant, which is up to 300 feet below a mountain about 20 miles from the city of Qom. Current and former Israeli officials have long said that only the U.S., with its 15-ton \"bunker buster\" bombs fitted to B-2 stealth bombers, would be able to fully destroy the facility. The U.S. conducted its largest-ever deployment of B-2 bombers to the remote Indian Ocean base of U.S. Naval Support Facility Diego Garcia in March. While at least some of the B-2s reportedly returned to the fleet's headquarters at Missouri's Whiteman Air Force Base, recent satellite imagery viewed by Newsweek indicated the presence of B-52 bombers, KC-135 tankers, F-15 fighters and a C-5M heavy transport aircraft at Diego Garcia. The U.S. has since reportedly sent additional F-16, F-22 and F-35 fighter jets to the region, as well as K-C135R and KC-46A air tankers used for refueling during air missions. Meanwhile, the USS Nimitz carrier group is currently in transit from the South China Sea toward the Middle East, where the USS Carl Vinson carrier group has been operating since spring. Pentagon officials have thus far maintained that U.S. forces were being added to the region \"to sustain our defensive posture and safeguard American personnel.\" Major Powers React The four U.N. Security Council permanent members other than the U.S. have called for deescalation in the raging conflict between Israel and Iran. Top officials from China, France and Russia have explicitly appealed for the U.S. not to strike Iran, while the U.K. has adopted a more cautious approach. The U.K., which was the sole U.N. Security Council permanent member to join the U.S.-led invasion of Iraq in 2003, owns the Diego Garcia base leased by the U.S. U.K. Prime Minister Keir Starmer was set to hold an urgent national security meeting Wednesday to discuss the rising tensions. Meanwhile, U.K. Deputy Prime Minister Angela Rayner responded to parliamentary criticism over London's role in backing Washington in the Iraq War by saying that \"we agree with President Trump that Iran must never have nuclear weapons, but we've been consistent in urging to Iran to engage in the diplomatic process and work with the United States, and we continue to support that diplomatic approach.\" During his press briefing with reporters Wednesday, Trump said that Russian President Vladimir Putin had offered to mediate in the conflict with Iran, an offer the U.S. leader rejected as he argued resolving the ongoing Russia-Ukraine war should be his Russian counterpart's priority. Earlier, Russian Deputy Foreign Minister Sergei Ryabkov told the Interfax News Agency that \"we warn Washington against even speculative, theoretical options of direct military assistance to Israel,\" as \"such a step would radically destabilize the entire situation.\" Responding to Trump's threats to Khamenei and calls for Iran's capitulation, Chinese Foreign Ministry spokesperson Guo Jiakun told reporters Wednesday that Beijing was \"deeply worried\" about the conflict and \"has expressed concerns on that.\" \"We oppose any move that violates the purposes and principles of the U.N. Charter and a country's sovereignty, security and territorial integrity,\" Guo said. \"Further escalation in the Middle East serves no one's interests.\" He said that \"the country with special influence on Israel,\" a veiled reference to the U.S., \"in particular needs to maintain a fair and objective position, take up due responsibility and play a positive and constructive role for deescalation and preventing further spread of the conflict.\" French President Emmanuel Macron, a NATO ally who has clashed with Trump on several occasions, issued a direct appeal Tuesday against operations that could be used to overthrow the Iranian government, citing past mistakes in Iraq and Libya. \"We don't want Iran to get a nuclear weapon,\" Macron said. \"But the biggest error would be to use military strikes to change the regime because it would then be chaos and our responsibility is to return discussions as quickly as possible to be able to set a course again on the nuclear and ballistic question.\" Update 6/18/25, 3:39 p.m. ET: This story was updated with additional information.","summary":"Iran's envoy wanted of \"irreversible consequences\" if the U.N. fails to end the war in a letter obtained by Newsweek.","author":"Based in his hometown of Staten Island, New York City, Tom O'Connor is an award-winning Senior Writer of Foreign Policy and Deputy Editor of National Security and Foreign Policy at Newsweek, where he specializes in covering the Middle East, North Korea, China, Russia and other areas of international affairs, relations and conflict. He has previously written for International Business Times, the New York Post, the Daily Star (Lebanon) and Staten Island Advance. His works have been cited in more than 1,800 academic papers, government reports, books, news articles and other forms of research and media from across the globe. He has contributed analysis to a number of international outlets and has participated in Track II diplomacy related to the Middle East as well as in fellowships at The Korea Society and Foreign Press Center Japan. Follow @ShaolinTom for daily news on X and his official Facebook page. Email t.oconnor@newsweek.com with tips or for media commentary and appearances. Languages: English and Arabic\nWriters Page\n\n\n\n\n\n\n\n Tom O'Connor"}]}